let cityCenterList = [
  {
    "name": "郑州市",
    "level": "2",
    "coordX": "113.631419",
    "coordY": "34.753438",
    "code": "410100"
  },
  {
    "name": "开封市",
    "level": "3",
    "coordX": "114.314592",
    "coordY": "34.802885",
    "code": "410200"
  },
  {
    "name": "洛阳市",
    "level": "3",
    "coordX": "112.459421",
    "coordY": "34.624262",
    "code": "410300"
  },
  {
    "name": "平顶山市",
    "level": "3",
    "coordX": "113.199528",
    "coordY": "33.772050",
    "code": "410400"
  },
  {
    "name": "安阳市",
    "level": "3",
    "coordX": "114.399500",
    "coordY": "36.105940",
    "code": "410500"
  },
  {
    "name": "鹤壁市",
    "level": "3",
    "coordX": "114.303593",
    "coordY": "35.752357",
    "code": "410600"
  },
  {
    "name": "新乡市",
    "level": "3",
    "coordX": "113.92",
    "coordY": "35.30",
    "code": "410700"
  },
  {
    "name": "焦作市",
    "level": "3",
    "coordX": "113.248547",
    "coordY": "35.220963",
    "code": "410800"
  },
  {
    "name": "濮阳市",
    "level": "3",
    "coordX": "115.035597",
    "coordY": "35.767592",
    "code": "410900"
  },
  {
    "name": "许昌市",
    "level": "3",
    "coordX": "113.858475",
    "coordY": "34.041431",
    "code": "411000"
  },
  {
    "name": "漯河市",
    "level": "3",
    "coordX": "114.023420",
    "coordY": "33.587710",
    "code": "411100"
  },
  {
    "name": "三门峡市",
    "level": "3",
    "coordX": "111.206533",
    "coordY": "34.778327",
    "code": "411200"
  },
  {
    "name": "南阳市",
    "level": "3",
    "coordX": "112.534501",
    "coordY": "32.996562",
    "code": "411300"
  },
  {
    "name": "商丘市",
    "level": "3",
    "coordX": "115.662449",
    "coordY": "34.420201",
    "code": "411400"
  },
  {
    "name": "信阳市",
    "level": "3",
    "coordX": "114.097482",
    "coordY": "32.153014",
    "code": "411500"
  },
  {
    "name": "周口市",
    "level": "3",
    "coordX": "114.707982",
    "coordY": "33.643083",
    "code": "411600"
  },
  {
    "name": "驻马店市",
    "level": "3",
    "coordX": "114.028470",
    "coordY": "33.017842",
    "code": "411700"
  },
  {
    "name": "济源市",
    "level": "3",
    "coordX": "112.608580",
    "coordY": "35.072907",
    "code": "419001"
  }
]